import React from 'react';

export const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      <h1 className="title">Політика конфіденційності</h1>
      <p className="date">Дата набрання чинності: 20.09.2024</p>

      <h2 className="section-title">1. Інформація, яку ми збираємо</h2>
      <p>
        Ми можемо збирати та обробляти такі типи інформації про вас:
      </p>
      <ul>
        <li>Персональні дані: Ім'я, адреса електронної пошти, номер телефону та інша інформація, яку ви надаєте.</li>
        <li>Дані про замовлення: Інформація про ваші покупки, включаючи деталі продукту, ціну та дату покупки.</li>
        <li>Технічні дані: IP-адреса, інформація про браузер та інші дані, які ми автоматично збираємо.</li>
      </ul>

      <h2 className="section-title">2. Як ми використовуємо вашу інформацію</h2>
      <p>Ми використовуємо вашу інформацію для наступних цілей:</p>
      <ul>
        <li>Для обробки та виконання ваших замовлень.</li>
        <li>Для зв'язку з вами щодо вашого замовлення.</li>
        <li>Для покращення нашого сайту та сервісу.</li>
        <li>Для надсилання вам маркетингових матеріалів, якщо ви підписалися на наші розсилки.</li>
      </ul>

      <h2 className="section-title">3. Захист даних</h2>
      <p>
        Ми вживаємо всіх необхідних заходів для захисту ваших персональних даних від несанкціонованого доступу та втрати.
      </p>

      <h2 className="section-title">4. Розкриття вашої інформації</h2>
      <p>
        Ми не передаватимемо ваші персональні дані третім особам, крім випадків, необхідних для виконання ваших замовлень.
      </p>

      <h2 className="section-title">5. Ваші права</h2>
      <p>Ви маєте право:</p>
      <ul>
        <li>Запитувати доступ до ваших персональних даних.</li>
        <li>Запитувати виправлення ваших персональних даних.</li>
        <li>Запитувати видалення ваших персональних даних.</li>
      </ul>

      <h2 className="section-title">6. Зміни у політиці конфіденційності</h2>
      <p>
        Ми можемо періодично оновлювати цю політику конфіденційності. Ми повідомимо вас про будь-які зміни, розмістивши нову політику на нашому сайті.
      </p>

      <h2 className="section-title">7. Контактна інформація</h2>
      <p>
        Якщо у вас є питання щодо цієї політики конфіденційності, ви можете зв'язатися з нами за наступною адресою:
      </p>
      <p>
        vasilchenko.maksim@374gmail.com <br />
        +380685929820<br />
      </p>
    </div>
  );
};
